Revit 2024 API
DocumentSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual DocumentSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As DocumentSetIterator
Visual C++
public:
virtual DocumentSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
DocumentSet Class
Autodesk.Revit.DB Namespace